import 'package:flutter/material.dart';
// ReaderScreen လမ်းကြောင်းကို မှန်ကန်စွာ Import ခေါ်ပါ
import 'package:tipitaka_myanmar/features/reader/presentation/pages/reader_screen.dart';

class PitakaDetailScreen extends StatelessWidget {
  final String pitakaTitle; // အဓိက ပိဋကတ်ခေါင်းစဉ် (ReaderScreen သို့ ပို့ရန်)
  final String title;
  final String fileName; // JSON ဖိုင်နာမည် (ReaderScreen သို့ ပို့ရန်)
  final List<String> subCategories;

  const PitakaDetailScreen({
    super.key,
    required this.pitakaTitle,
    required this.title,
    required this.fileName,
    required this.subCategories,
  });

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(title),
        backgroundColor: Colors.brown,
        foregroundColor: Colors.white,
      ),
      body: ListView.separated(
        padding: const EdgeInsets.all(12.0),
        itemCount: subCategories.length,
        separatorBuilder: (context, index) => const Divider(),
        itemBuilder: (context, index) {
          final subTitle = subCategories[index];

          return ListTile(
            leading: const Icon(Icons.bookmark, color: Colors.brown),
            title: Text(
              subTitle,
              style: const TextStyle(fontSize: 16, fontWeight: FontWeight.w500),
            ),
            trailing: const Icon(
              Icons.arrow_forward_ios,
              size: 16,
              color: Colors.grey,
            ),
            onTap: () {
              List<String> chapters = [];

              if (subTitle.contains('၁။ ပါရာဇိက')) {
                chapters = [
                  '၁။ ပဌမ ပါရာဇိက',
                  '၂။ ဒုတိယ ပါရာဇိက',
                  '၃။ တတိယ ပါရာဇိက',
                  '၄။ စတုတ္ထ ပါရာဇိက',
                  'ပါရာဇိက အကျဉ်းချုပ်',
                ];
              } else if (subTitle.contains('သံဃာဒိသိသ်')) {
                chapters = [
                  '၀၁။ သုက္ကဝိဿဋ္ဌိသိက္ခာပုဒ်',
                  '၀၂။ ကာယသံသဂ္ဂသိက္ခာပုဒ်',
                  '၀၃။ ဒုဋ္ဌုလ္လဝါစာသိက္ခာပုဒ်',
                  '၀၄။ အတ္တကာမပါရိစရိယသိက္ခာပုဒ်',
                  '၀၅။ သဉ္စရိတ္တသိက္ခာပုဒ်',
                  '၀၆။ ကုဋိကာရသိက္ခာပုဒ်',
                  '၀၇။ ဝိဟာရကာရသိက္ခာပုဒ်',
                  '၀၈။ ဒုဋ္ဌဒေါသသိက္ခာပုဒ်',
                  '၀၉။ ဒုတိယဒုဋ္ဌဒေါသသိက္ခာပုဒ်',
                  '၁၀။ သင်္ဃဘေဒသိက္ခာပုဒ်',
                  '၁၁။ ဘေဒါနုဝတ္တကသိက္ခာပုဒ်',
                  '၁၂။ ဒုဗ္ဗစသိက္ခာပုဒ်',
                  '၁၃။ ကုလဒူသကသိက္ခာပုဒ်',
                  'သံဃာဒိသိသ် အကျဉ်းချုပ်',
                ];
              } else if (subTitle.contains('၃။ အနိယတ')) {
                chapters = [
                  '၁။ ပဌမအနိယတသိက္ခာပုဒ်',
                  '၂။ ဒုတိယအနိယတသိက္ခာပုဒ်',
                  'အနိယတသိက္ခာပုဒ်  အကျဉ်းချုပ်',
                ];
              } else if (subTitle.contains('၄။ နိဿဂ္ဂိယ')) {
                chapters = ['၁။ စီဝရဝဂ်', '၂။ ကောသိယဝဂ်', '၃။ ပတ္တဝဂ်'];
              }
              // နိဿဂ္ဂိယ ၏ Sub Chapters များ (ပုံမှ ရယူထားသည်)
              else if (subTitle.contains('၁။ စီဝရဝဂ်')) {
                chapters = [
                  '၀၁။ ပဌမ ကထိနသိက္ခာပုဒ်',
                  '၀၂။ ဥဒေါသိတ \'ဒုတိယကထိန\' သိက္ခာပုဒ်',
                  '၀၃။ တတိယ ကထိနသိက္ခာပုဒ်',
                  '၀၄။ ပုရာဏစီဝရသိက္ခာပုဒ်',
                  '၀၅။ စီဝရပဋိဂ္ဂဟဏသိက္ခာပုဒ်',
                  '၀၆။ အညာတကဝိညတ္တိသိက္ခာပုဒ်',
                  '၀၇။ တတုတ္တရိသိက္ခာပုဒ်',
                  '၀၈။ ဥပက္ခဋသိက္ခာပုဒ်',
                  '၀၉။ ဒုတိယဥပက္ခဋသိက္ခာပုဒ်',
                  '၁၀။ ရာဇသိက္ခာပုဒ်',
                  'နိဿဂ္ဂိယ စီဝရဝဂ် အကျဉ်းချုပ်',
                ];
              } else if (subTitle.contains('၂။ ကောသိယဝဂ်')) {
                chapters = [
                  '၀၁။ ကောသိယသိက္ခာပုဒ်',
                  '၀၂။ သုဒ္ဓကာဠကသိက္ခာပုဒ်',
                  '၀၃။ ဒွေဘာဂသိက္ခာပုဒ်',
                  '၀၄။ ဆဗ္ဗဿသိက္ခာပုဒ်',
                  '၀၅။ နိသီဒနသန္ထတသိက္ခာပုဒ်',
                  '၀၆။ ဧဠကလောမသိက္ခာပုဒ်',
                  '၀၇။ ဧဠကလောမဓောဝါပနသိက္ခာပုဒ်',
                  '၀၈။ ရူပိယသိက္ခာပုဒ်',
                  '၀၉။ ရူပိယသံဝေါဟာရသိက္ခာပုဒ်',
                  '၁၀။ ကယဝိက္ကယသိက္ခာပုဒ်',
                  'နိဿဂ္ဂိယ ကောသိယဝဂ် အကျဉ်းချုပ်',
                ];
              } else if (subTitle.contains('၃။ ပတ္တဝဂ်')) {
                chapters = [
                  '၀၁။ ပတ္တသိက္ခာပုဒ်',
                  '၀၂။ ဦနပဉ္စဗန္ဓနသိက္ခာပုဒ်',
                  '၀၃။ ဘေသဇ္ဇသိက္ခာပုဒ်',
                  '၀၄။ ဝဿိကသာဋိကသိက္ခာပုဒ်',
                  '၀၅။ စီဝရအစ္ဆိန္ဒနသိက္ခာပုဒ်',
                  '၀၆။ သုတ္တဝိညတ္တိသိက္ခာပုဒ်',
                  '၀၇။ မဟာပေသကာရသိက္ခာပုဒ်',
                  '၀၈။ အစ္စေကစီဝရသိက္ခာပုဒ်',
                  '၀၉။ သာသင်္ကသိက္ခာပုဒ်',
                  '၁၀။ ပရိဏတသိက္ခာပုဒ်',
                  'နိဿဂ္ဂိယ (တတိယဝဂ်) ပတ္တဝဂ် အကျဉ်းချုပ်',
                ];
              } else if (subTitle.contains('၅။ ဝိနယပိဋက') ||
                  subTitle == 'ဝိနယပိဋက') {
                chapters = [
                  'ဘိက္ခုဝိဘင်း',
                  'ဘိက္ခုနီဝိဘင်း',
                  'မဟာဝဂ္ဂ',
                  'စူဠဝဂ္ဂ',
                  'ပရိဝါရ',
                ];
              } else if (subTitle.contains('ဘိက္ခုဝိဘင်း')) {
                chapters = [
                  '၀၁။ မုသာဝါဒဝဂ်',
                  '၀၂။ ဘူတဂါမဝဂ်',
                  '၀၃။ ဩဝါဒဝဂ်',
                  '၀၄။ ဘောဇနဝဂ်',
                  '၀၅။ အစေလကဝဂ်',
                  '၀၆။ သုရာပါနဝဂ်',
                  '၀၇။ သပ္ပါဏကဝဂ်',
                  '၀၈။ သဟဓမ္မိကဝဂ်',
                  '၀၉။ ရတနဝဂ်',
                ];
              } else if (subTitle.contains('ဘိက္ခုနီဝိဘင်း')) {
                chapters = [
                  '၀၁။ ပါရာဇိက အခန်း',
                  '၀၂။ သံဃာဒိသိသ် အခန်း',
                  '၀၃။ နိဿဂ္ဂိ အခန်း',
                  '၀၄။ ပါစိတ် အခန်း',
                  '၀၅။ ပါဋိဒေသနီ အခန်း',
                  '၀၆။ သေခိယ အခန်း',
                  '၀၇။ အဓိကရဏသမထ အခန်း',
                ];
              } else if (subTitle.contains('မဟာဝဂ္ဂ')) {
                chapters = [
                  '၀၁။ မဟာခန္ဓက',
                  '၀၂။ ဥပေါသထက္ခန္ဓက',
                  '၀၃။ ဝဿူပနာယိကက္ခန္ဓက',
                  '၀၄။ ပဝါရဏာက္ခန္ဓက',
                  '၀၅။ စမ္မက္ခန္ဓက',
                  '၀၆။ ဘေသဇ္ဇက္ခန္ဓက',
                  '၀၇။ ကထိနက္ခန္ဓက',
                  '၀၈။ စီဝရက္ခန္ဓက',
                  '၀၉။ စမ္ပေယျက္ခန္ဓက',
                  '၁၀။ ကောသမ္ဗကက္ခန္ဓက',
                ];
              } else if (subTitle.contains('စူဠဝဂ္ဂ')) {
                chapters = [
                  '၀၁။ ကမ္မက္ခန္ဓက',
                  '၀၂။ ပါရိဝါသိကက္ခန္ဓက',
                  '၀၃။ သမုစ္စယက္ခန္ဓက',
                  '၀၄။ သမထက္ခန္ဓက',
                  '၀၅။ ခုဒ္ဒကဝတ္ထုက္ခန္ဓက',
                  '၀၆။ သေနာသနက္ခန္ဓက',
                  '၀၇။ သံဃဘေဒကက္ခန္ဓက',
                  '၀၈။ ဝတ္တက္ခန္ဓက',
                  '၀၉။ ပါတိမောက္ခဋ္ဌပနက္ခန္ဓက',
                  '၁၀။ ဘိက္ခုနီက္ခန္ဓက',
                  '၁၁။ ပဉ္စသတိကာက္ခန္ဓက',
                  '၁၂။ သတ္တသတိကာက္ခန္ဓက',
                ];
              } else if (subTitle.contains('ပရိဝါရ')) {
                chapters = ['သမုဋ္ဌာန် ခေါင်းစဥ် အကျဥ်း', 'အန္တရပေယျာလ'];
              } else if (subTitle.contains('သုတ္တန္တပိဋက')) {
                chapters = [
                  'ဒီဃနိကာယ',
                  'မဇ္ဈိမနိကာယ',
                  'သံယုတ္တနိကာယ',
                  'အင်္ဂုတ္တရနိကာယ',
                  'ခုဒ္ဒကနိကာယ',
                ];
              } else if (subTitle.contains('ဒီဃနိကာယ')) {
                chapters = [
                  'သီလက္ခန္ဓဝဂ္ဂ',
                  'မဟာဝဂ္ဂ',
                  'ပါထိကဝဂ္ဂ',
                  'ခုဒ္ဒကနိကာယ',
                ];
              } else if (subTitle.contains('သီလက္ခန္ဓဝဂ္ဂ')) {
                chapters = [
                  '၀၁။ ဗြဟ္မဇာလသုတ်',
                  '၀၂။ သာမညဖလသုတ်',
                  '၀၃။ အမ္ဗဋ္ဌသုတ်',
                  '၀၄။ သောဏဒဏ္ဍသုတ်',
                  '၀၅။ ကူဋဒန္တသုတ်',
                  '၀၆။ မဟာလိသုတ်',
                  '၀၇။ ဇာလိယသုတ်',
                  '၀၈။ မဟာသီဟနာဒသုတ်',
                  '၀၉။ ပေါဋ္ဌပါဒသုတ်',
                  '၁၀။ သုဘသုတ်',
                  '၁၁။ ကေဝဋ္ဋသုတ်',
                  '၁၂။ လောဟိစ္စသုတ်',
                  '၁၃။ တေဝိဇ္ဇသုတ်',
                ];
              } else if (subTitle.contains('မဟာဝဂ္ဂ')) {
                chapters = [
                  '၀၁။ မဟာပဒါနသုတ်',
                  '၀၂။ မဟာနိဒါနသုတ်',
                  '၀၃။ မဟာပရိနိဗ္ဗာနသုတ်',
                  '၀၄။ မဟာသုဒဿနသုတ်',
                  '၀၅။ ဇနဝသဘသုတ်',
                  '၀၆။ မဟာဂေါဝိန္ဒသုတ်',
                  '၀၇။ မဟာသမယသုတ်',
                  '၀၈။ သက္ကပဉှသုတ်',
                  '၀၉။ မဟာသတိပဋ္ဌာနသုတ်',
                  '၁၀။ ပါယာသိသုတ်',
                ];
              } else if (subTitle.contains('ပါထိကဝဂ္ဂ')) {
                chapters = [
                  '၀၁။ ပါထိကသုတ်',
                  '၀၂။ ဥဒုမ္ဗရိကသုတ်',
                  '၀၃။ စက္ကဝတ္တိသုတ်',
                  '၀၄။ အဂ္ဂညသုတ်',
                  '၀၅။ သမ္ပသာဒနီယသုတ်',
                  '၀၆။ ပါသာဒိကသုတ်',
                  '၀၇။ လက္ခဏသုတ်',
                  '၀၈။ သိင်္ဂါလသုတ်',
                  '၀၉။ အာဋာနာဋိယသုတ်',
                  '၁၀။ သင်္ဂီတိသုတ်',
                  '၁၁။ ဒသုတ္တရသုတ်',
                ];
              } else if (subTitle.contains('မဇ္ဈိမနိကာယ')) {
                chapters = [
                  'မူလပဏ္ဏာသ',
                  'မဇ္ဈိမပဏ္ဏာသ',
                  'ဥပရိပဏ္ဏာသ',
                  'သဂါထာဝဂ္ဂ',
                ];
              } else if (subTitle.contains('သံယုတ္တနိကာယ')) {
                chapters = ['နိဒါနဝဂ္ဂ', 'ခန္ဓဝဂ္ဂ', 'သဠာယတနဝဂ္ဂ', 'မဟာဝဂ္ဂ'];
              } else if (subTitle.contains('အင်္ဂုတ္တရနိကာယ')) {
                chapters = [
                  'ဧကကနိပါတ်',
                  'ဒုကနိပါတ်',
                  'တိကနိပါတ်',
                  'စတုက္ကနိပါတ်',
                  'ပဉ္စကနိပါတ်',
                  'ဆက္ကနိပါတ်',
                  'သတ္တကနိပါတ်',
                  'အဋ္ဌကနိပါတ်',
                  'နဝကနိပါတ်',
                  'ဒသကနိပါတ်',
                  'ဧကာဒသကနိပါတ်',
                ];
              } else if (subTitle.contains('ခုဒ္ဒကနိကာယ')) {
                chapters = [
                  'ခုဒ္ဒကပါဌ',
                  'ဓမ္မပဒ',
                  'ဥဒါန',
                  'ဣတိဝုတ္တက',
                  'သုတ္တနိပါတ',
                  'ဝိမာနဝတ္ထု',
                  'ပေတဝတ္ထု',
                  'ပဋိသမ္ဘိဒါမဂ္ဂ',
                  'ထေရာပဒါန်',
                  'ထေရီအပဒါန်',
                  'ဗုဒ္ဓဝံသ',
                  'စရိယာပိဋက',
                  'မိလိန္ဒပဥှာ ',
                ];
              } else if (subTitle.contains('အဘိဓမ္မပိဋက')) {
                chapters = ['ဓမ္မသင်္ဂဏီ', 'ဝိဘင်္ဂ', 'ပုဂ္ဂလပညတ်', 'ကထာဝတ္ထု'];
              } else if (subTitle.contains('ဓမ္မသင်္ဂဏီ')) {
                chapters = [
                  'မာတိကာ',
                  '၁။ စိတ္တုပ္ပါဒကဏ္ဍ',
                  '၂။ ရူပကဏ္ဍ',
                  '၃။ နိက္ခေပကဏ္ဍ',
                  '၄။ အဋ္ဌကထာကဏ္ဍ',
                ];
              } else if (subTitle.contains('ဝိဘင်္ဂ')) {
                chapters = [
                  '၀၁။ ခန္ဓ ဝိဘင်္ဂ',
                  '၀၂။ အာယတန ဝိဘင်္ဂ',
                  '၀၃။ ဓာတု ဝိဘင်္ဂ',
                  '၀၄။ သစ္စ ဝိဘင်္ဂ',
                  '၀၅။ ဣန္ဒြိယ ဝိဘင်္ဂ',
                  '၀၆။ ပဋိစ္စသမုပ္ပါဒ ဝိဘင်္ဂ',
                  '၀၇။ သတိပဋ္ဌာန ဝိဘင်္ဂ',
                  '၀၈။ သမ္မပ္ပဓာန ဝိဘင်္ဂ',
                  '၀၉။ ဣဒ္ဓိပါဒ ဝိဘင်္ဂ',
                  '၁၀။ ‌ဗောဇ္ဈိ‌င်္ဂ ဝိဘင်္ဂ',
                  '၁၁။ မဂ္ဂင်္ဂ ဝိဘင်္ဂ',
                  '၁၂။ စျာန ဝိဘင်္ဂ',
                  '၁၃။ အပ္ပမညာ ဝိဘင်္ဂ ',
                  '၁၄။ သိက္ခာပဒ ဝိဘင်္ဂ',
                  '၁၅။ ပဋိသမ္ဘိဒါ ဝိဘင်္ဂ',
                  '၁၆။ ဉာဏ ဝိဘင်္ဂ',
                  '၁၇။ ခုဒ္ဒကဝတ္ထု ဝိဘင်္ဂ',
                  '၁၈။ ဓမ္မဟဒယ ဝိဘင်္ဂ',
                ];
              } else if (subTitle.contains('ပုဂ္ဂလပညတ်')) {
                chapters = ['မာတိကာ', 'နိဒ္ဒေသ'];
              } else if (subTitle.contains('ကထာဝတ္ထု')) {
                chapters = [
                  '၀၁။ ပုဂ္ဂလကထာ',
                  '၀၂။ ဒုတိယဝဂ်',
                  '၀၃။ တတိယဝဂ်',
                  '၀၄။ စတုတ္ထဝဂ်',
                  '၀၅။ ပဉ္စမဝဂ်',
                  '၀၆။ ဆဋ္ဌဝဂ်',
                  '၀၇။ သတ္တမဝဂ်',
                  '၀၈။ အဋ္ဌမဝဂ်',
                  '၀၉။ နဝမဝဂ်',
                  '၁၀။ ဒသမဝဂ်',
                  '၁၁။ ဧကာဒသမဝဂ်',
                  '၁၂။ ဒွါဒသမဝဂ်',
                  '၁၃။ တေရသမဝဂ်',
                  '၁၄။ စုဒ္ဒသမဝဂ်',
                  '၁၅။ ပန္နရသမဝဂ်',
                  '၁၆။ သောဠသမဝဂ်',
                  '၁၇။ သတ္တရသမဝဂ်',
                  '၁၈။ အဋ္ဌာရသမဝဂ်',
                  '၁၉။ ဧကူနဝီသတိမဝဂ်',
                  '၂၀။ ဝီသတိမဝဂ်',
                  '၂၁။ ဧကဝီသတိမဝဂ်',
                  '၂၂။ ဗာဝီသတိမဝဂ်',
                  '၂၃။ တေဝီသတိမဝဂ်',
                ];
              } else if (subTitle.contains('၀၁။ ပုဂ္ဂလကထာ')) {
                chapters = [
                  '၀၁။ ပုဂ္ဂလကထာ',
                  '၀၂။ ပရိယာနိကထာ',
                  '၀၃။  ဗြဟ္မစရိယကထာ',
                  '၀၄။ ဇဟတိကထာ',
                  '၀၅။ သဗ္ဗမတ္ထီတိကထာ',
                  '၀၆။ အတီတက္ခန္ဓာဒိကထာ',
                  '၀၇။ ဧကစ္စံ အတ္ထီတိကထာ',
                  '၀၈။ သတိပဋ္ဌာနကထာ',
                  '၀၉။ ဟေဝတ္ထိကထာ',
                ];
              }

              // Navigation Logic
              if (chapters.isNotEmpty) {
                // တတိယအဆင့် Sub-titles များရှိပါက Chapter List ဆီသို့ သွားရန်
                Navigator.push(
                  context,
                  MaterialPageRoute(
                    builder: (context) => PitakaDetailScreen(
                      pitakaTitle:
                          pitakaTitle, // မူလ Title ကို ဆက်လက်သယ်ဆောင်သွားရန်
                      title: subTitle,
                      fileName: fileName, // ဖိုင်နာမည်ကို အဆင့်ဆင့် ဆက်လက်သယ်ဆောင်သွားရန်
                      subCategories: chapters,
                    ),
                  ),
                );
              } else {
                // Chapter ထပ်မရှိတော့ပါက စာဖတ်ရန် (Reader Screen) ဆီသို့ တိုက်ရိုက်သွားရန် ပြင်ဆင်ထားပါသည်
                Navigator.push(
                  context,
                  MaterialPageRoute(
                    builder: (context) => ReaderScreen(
                      pitakaTitle: pitakaTitle,
                      subTitle: title, // ယခင် Screen မှ title ကို subTitle အဖြစ်သတ်မှတ်ပါသည်
                      chapterTitle: subTitle, // ယခုနှိပ်လိုက်သော စာကြောင်းကို chapterTitle အဖြစ်သတ်မှတ်ပါသည်
                      fileName: fileName, // အရေးကြီးဆုံး: Reader Screen က JSON ဖတ်ရန် လှမ်းပို့ပေးပါသည်
                    ),
                  ),
                );
              }
            },
          );
        },
      ),
    );
  }
}
